users={
    "user_0":{"name":"Zero","password":"0000","card_numer":"0000 0000"},
    "user_1":{"name":"Haos","password":"4114","card_numer":"0000 0000"},
    "user_2":{"name":"Rent","password":"3113","card_numer":"0000 0000"},
    "user_3":{"name":"Raya","password":"2112","card_numer":"0000 0000"}

}

products = {
    "Молоко": 12, "Хлеб": 2, "Сыр": 15, "Грибы": 8, "Вода": 2,
    "Яблоко": 5, "Апельсин": 5, "Мясо": 20, "Рыба": 18, "Яйца": 10,
    "Магические Грибы": 33, "Сыр с Плесенью Гнома": 27, "Черный Хлеб": 6, "Синее Молоко": 19, "Огненный Перец": 14,
    "Лунная Соль": 11, "Кристальный Сахар": 13, "Теневой Чай": 16, "Кофе Бездны": 22, "Мед Призрака": 25,
    "Обсидиановая Морковь": 17, "Проклятая Картошка": 9, "Золотой Лук": 12, "Ягоды Свободы": 21, "Суп Странника": 30
}