num=5
list=[2,5,9,4,3.14,True,"Hello",num,list,["Hello","World"]] #отсчет идет с нуля

list[2]=69 #меняем третий элемент

print(list[4])#берем конкретный элемент
print(list)
print(list[-1][1])# тут мы берем из главного списка последний элемент и это у нас список и мы от туда берем определеное число

nums=[5,3,8,6]

nums.append(100)#добавляет последним индексом
nums.insert(1,3.14) #ставит этот элемент по нужному индексу а тот элемент сдвигает вперед [5, 3.14, 3, 8, 6, 100]
print(nums)

niss=[3,5,7,4]
ex=[10,34,55]

niss.extend(ex) #просто добавляет сразу много элементов
#niss.extend([10,34,55]) #тоже самое

print(niss)

nums.sort()#сортирауте от самого маленького до самого большого true=1 false=0 с string не работает
nums.reverse()#переворачивает список

print(nums)

print(" ")

niss.sort()#сортирауте от самого маленького до самого большого true=1 false=0 с string не работает
print(niss)

print(" ")

niss.pop()#удаляет элемент по индексу если в скобках пусто удаляется последний элемент
niss.remove(3)#удаляет элемент не по индексу а по значению то есть есть ли там элемент то есть удаляем одну тройку
print(niss)

nums.clear()#очисчает весь список
nums.append(52) # добавляет в конец списка элемент
print(nums)

print(" ")

niss.insert(3,4)
print(niss.count(4),"4 was found") #считает количество определеных элементов в данном случае 4 всего у нас 2 четверки


trinity=[4,7,3,9,3,3,0]
trinity.remove(3) #тут удаляем только одну тройку метод описал на 36-38 строке
print(trinity)

print("длина списка niss- ",len(niss),)# len() показывает количество элементов в списке кол эл 6
print("вот и сам список- ",niss)

# длина списка niss-  6
# вот и сам список-  [4, 5, 7, 4, 10, 34]

print("")

le=int(input("write length- ")) # узнаем какой длины должен быть список
listik=[]

for i in range(le): #получаем элементы столько сколько указали сверху
    print("Write",i+1,"element") # тут i+1 что бы красиво отображалось
    listik.append(input("> ")) #добавляем элементы в список

print("Do u want to sort ur list? (yes,not)")

while True: # повторяем цыйкл пока не получим понятный ответ
    answer=input("> ")
    #можно написать еше так if answer in ("yes","y"):
    if answer=="yes" or answer=="y": # проверняем ответ or это что бы узнать или то или то
        listik.sort() # тут сортируем список
        print(listik)
        break #смысл продолжать нет так что остановим
    # тут тоже if answer in ("not","n")
    elif answer=="not" or answer=="n": # проверняем ответ or это что бы узнать или то или то
        print(listik)
        break #смысл продолжать нет так что остановим
    else:
        print("sorry, answer is unknown") #пишем что команда неопознана и повторяем цыкл