print(5*3)# умножаем
print(10/2) # делим
print(2**3) # степень

print(" ")

print(10//3) #цельное деление ответ 3
print(10%3) # остаток от деление ответ 1

print(" ")

print("числа- 10, 5, 3, 8, -3, 6, -9",)
print("минимум:", min(10, 5, 3, 8, -3, 6, -9))#находит самое маленькое
print("максимум:", max(10, 5, 3, 8, -3, 6, -9))#находит самое большое

print(" ")

print(abs(-5))# модуль

print(pow(2,4))# возводит в степерь то же самое что и 2**4

print(round(5/3)) #округляет число ответ 2 из за того что выходит 1.6
print(round(5/4)) #округляет число ответ 1 из за того что выходит 1.25