print("Hello, World!")
'''// This is a comment in Python. It is ignored by the interpreter.'''
# This is another comment in Python. It is also ignored by the interpreter.

print("Пример 4+4=8 это-",4+4==8)
print("Пример 3+9=",3+9)

print(" ")

# функцыя sep=" " заменяет запетую на любой символ который мы укажем
print("Результат- ", 7,"a", 15, ".",sep="d") #Результат- d7dad15d.
print("Результат- ", 7,"a", 15, ".",sep="") #Результат- 7a15.

print(" ")

#функцыя end=" " заменяет перенос на следуюшию строку на любой символ который мы укажем
#по умолчанию end="\n" - это перенос на следуюшию строку
#если хотим все в одуну строку то end=""
print("Конец это не конец",end=" didi ")
print("Потому что я так сказал")
#Конец это не конец didi Потому что я так сказал

# так же можно сделать так end="/n и любой текст"
print("Конец это не конец", end=" didi \n didi ")
print("Потому что я так сказал")
#Конец это не конец didi
# didi Потому что я так сказал