try:
    with open("data/test.md","r",encoding="utf-8") as file: # открывает файл и автоматически закрывает его после работы
        print(file.read())
    # file.read() не будет работать потому что файл закрылся
except FileNotFoundError:
    print("файл не нашол")

# with временно создаёт объект, сохраняет его в переменную после as, выполняет код внутри блока, а потом автоматически удаляется



'''
Что такое with ... as?

with создаёт контекстный менеджер — объект, который автоматически выполняет действия при входе в блок и при выходе из него.

1. Открывается файл.
2. Переменная file получает объект файла.
3. Выполняется код внутри блока with.
4. После выхода из блока файл автоматически закрывается.


Что означает as file?

as file просто сохраняет результат работы выражения в переменную.
'''
